In [65]:
import pandas as pd

In [66]:
pd.Series(['banana',42])
# 데이터 넣기

0    banana
1        42
dtype: object

In [67]:
pd.Series(['banana',42],index=['name','age'],name='kind')

name    banana
age         42
Name: kind, dtype: object

In [68]:
pd.DataFrame({
    'Name':['FramKlin','Gosset'],
    'Born':['1922-07-20','1950-02-02'],
    'Age':[37,61],


})

       Name        Born  Age
0  FramKlin  1922-07-20   37
1    Gosset  1950-02-02   61

In [69]:
# 예시 저장된 데이터를 많이쓰지만 만드는법은 알아야된다...
pd.DataFrame([[1,2,3],[4,5,6],[7,8,9]],
            columns=['a','b','c'])

   a  b  c
0  1  2  3
1  4  5  6
2  7  8  9

In [70]:
df=pd.read_csv('data/scientists.csv',sep='\t')

In [71]:
df.drop_duplicates()

                       Name,Born,Died,Age,Occupation
0  Rosaline Franklin,1920-07-25,1958-04-16,37,Che...
1  William Gosset,1876-06-13,1937-10-16,61,Statis...
2  Florence Nightingale,1820-05-12,1910-08-13,90,...
3       Marie Curie,1867-11-07,1934-07-04,66,Chemist
4   Rachel Carson,1907-05-27,1964-04-14,56,Biologist
5       John Snow,1813-03-15,1858-06-16,45,Physician
6  Alan Turing,1912-06-23,1954-06-07,41,Computer ...
7  Johann Gauss,1777-04-30,1855-02-23,77,Mathemat...

In [72]:
df = pd.read_csv('data/scientists.csv')

In [73]:
df = pd.DataFrame({
    'brand': ['Yum Yum', 'Yum Yum', 'Indomie', 'Indomie', 'Indomie'],
    'style': ['cup', 'cup', 'cup', 'pack', 'pack'],
    'rating': [4, 4, 3.5, 15, 5]
})

In [74]:
df

     brand style  rating
0  Yum Yum   cup     4.0
1  Yum Yum   cup     4.0
2  Indomie   cup     3.5
3  Indomie  pack    15.0
4  Indomie  pack     5.0

In [75]:
df.drop_duplicates()

     brand style  rating
0  Yum Yum   cup     4.0
2  Indomie   cup     3.5
3  Indomie  pack    15.0
4  Indomie  pack     5.0

In [76]:
df.drop_duplicates(subset=['brand'])

     brand style  rating
0  Yum Yum   cup     4.0
2  Indomie   cup     3.5

In [81]:
df = pd.read_csv('data/scientists.csv')

In [82]:

df.sort_values(['Name','Age'],ascending=False)

                   Name        Born        Died  Age          Occupation
1        William Gosset  1876-06-13  1937-10-16   61        Statistician
0     Rosaline Franklin  1920-07-25  1958-04-16   37             Chemist
4         Rachel Carson  1907-05-27  1964-04-14   56           Biologist
3           Marie Curie  1867-11-07  1934-07-04   66             Chemist
5             John Snow  1813-03-15  1858-06-16   45           Physician
7          Johann Gauss  1777-04-30  1855-02-23   77       Mathematician
2  Florence Nightingale  1820-05-12  1910-08-13   90               Nurse
6           Alan Turing  1912-06-23  1954-06-07   41  Computer Scientist

SyntaxError: invalid syntax (791285630.py, line 1)

In [84]:
df['Age']

0    37
1    61
2    90
3    66
4    56
5    45
6    41
7    77
Name: Age, dtype: int64

In [85]:
df['Age'].to_frame()

   Age
0   37
1   61
2   90
3   66
4   56
5   45
6   41
7   77

In [86]:
df = pd.read_csv('data/scientists.csv')

In [87]:
df['Age'].mean()
# 평균값

59.125

In [88]:
df[df['Age'] >= df['Age'].mean()] #True Fals

                   Name        Born        Died  Age     Occupation
1        William Gosset  1876-06-13  1937-10-16   61   Statistician
2  Florence Nightingale  1820-05-12  1910-08-13   90          Nurse
3           Marie Curie  1867-11-07  1934-07-04   66        Chemist
7          Johann Gauss  1777-04-30  1855-02-23   77  Mathematician

In [ ]:
df['Age']>=df['Age'].mean()

In [ ]:
cond1=df['Age']>=df['Age'].mean()

In [ ]:
df[cond1]

In [ ]:
df[[True,False,True,False,True,False,True,False,]]

In [ ]:
df['Age']+df['Age']

In [ ]:
df['Age']+100

In [89]:
df['Age']+pd.Series([1,100])

0     38.0
1    161.0
2      NaN
3      NaN
4      NaN
5      NaN
6      NaN
7      NaN
dtype: float64

In [93]:
rev_age=df['Age'].sort_index(ascending=False)

In [94]:
rev_age

7    77
6    41
5    45
4    56
3    66
2    90
1    61
0    37
Name: Age, dtype: int64

In [95]:
rev_age+df['Age']

0     74
1    122
2    180
3    132
4    112
5     90
6     82
7    154
Name: Age, dtype: int64

In [97]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8 entries, 0 to 7
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Name        8 non-null      object
 1   Born        8 non-null      object
 2   Died        8 non-null      object
 3   Age         8 non-null      int64
 4   Occupation  8 non-null      object
dtypes: int64(1), object(4)
memory usage: 448.0+ bytes

In [108]:
born_datetime=pd.to_datetime(df['Born'],format='%Y-%m-%d')

In [109]:
died_datetime=pd.to_datetime(df['Died'],format='%Y-%m-%d')

In [110]:
df['born_dt'],df['died_dt']=(born_datetime,died_datetime)

In [114]:
df['died_dt']-df['born_dt']

0   13779 days
1   22404 days
2   32964 days
3   24345 days
4   20777 days
5   16529 days
6   15324 days
7   28422 days
dtype: timedelta64[ns]

In [115]:
pd.to_datetime('2023년12월8일',format='%Y년%m월%d일')

Timestamp('2023-12-08 00:00:00')

In [121]:
df.drop('Born',axis=1)
# 행삭제 상황에 따라서 접근이 다름

,Name,Died,Age,Occupation,born_dt,died_dt
0,Rosaline Franklin,1958-04-16,37,Chemist,1920-07-25,1958-04-16
1,William Gosset,1937-10-16,61,Statistician,1876-06-13,1937-10-16
2,Florence Nightingale,1910-08-13,90,Nurse,1820-05-12,1910-08-13
3,Marie Curie,1934-07-04,66,Chemist,1867-11-07,1934-07-04
4,Rachel Carson,1964-04-14,56,Biologist,1907-05-27,1964-04-14
5,John Snow,1858-06-16,45,Physician,1813-03-15,1858-06-16
6,Alan Turing,1954-06-07,41,Computer Scientist,1912-06-23,1954-06-07
7,Johann Gauss,1855-02-23,77,Mathematician,1777-04-30,1855-02-23

In [120]:
df.drop(1,axis=0)
# 인덱스 열삭제

,Name,Born,Died,Age,Occupation,born_dt,died_dt
0,Rosaline Franklin,1920-07-25,1958-04-16,37,Chemist,1920-07-25,1958-04-16
2,Florence Nightingale,1820-05-12,1910-08-13,90,Nurse,1820-05-12,1910-08-13
3,Marie Curie,1867-11-07,1934-07-04,66,Chemist,1867-11-07,1934-07-04
4,Rachel Carson,1907-05-27,1964-04-14,56,Biologist,1907-05-27,1964-04-14
5,John Snow,1813-03-15,1858-06-16,45,Physician,1813-03-15,1858-06-16
6,Alan Turing,1912-06-23,1954-06-07,41,Computer Scientist,1912-06-23,1954-06-07
7,Johann Gauss,1777-04-30,1855-02-23,77,Mathematician,1777-04-30,1855-02-23

In [123]:
df.drop(columns=['Died'],index=[3])
# 삭제된부분을 되살려준다.

,Name,Born,Age,Occupation,born_dt,died_dt
0,Rosaline Franklin,1920-07-25,37,Chemist,1920-07-25,1958-04-16
1,William Gosset,1876-06-13,61,Statistician,1876-06-13,1937-10-16
2,Florence Nightingale,1820-05-12,90,Nurse,1820-05-12,1910-08-13
4,Rachel Carson,1907-05-27,56,Biologist,1907-05-27,1964-04-14
5,John Snow,1813-03-15,45,Physician,1813-03-15,1858-06-16
6,Alan Turing,1912-06-23,41,Computer Scientist,1912-06-23,1954-06-07
7,Johann Gauss,1777-04-30,77,Mathematician,1777-04-30,1855-02-23

In [125]:
df.to_csv('test.csv')
# 저장하기